Revit 2027 API
FailureMessageAccessor.SetCurrentResolutionType Method
 Sets the type of a resolution to be used to resolve the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCurrentResolutionType(
	FailureResolutionType resolutionType
)
Public Sub SetCurrentResolutionType (
	resolutionType As FailureResolutionType
)
public:
void SetCurrentResolutionType(
	FailureResolutionType resolutionType
)
member SetCurrentResolutionType :
        resolutionType : FailureResolutionType -> unit
Parameters
resolutionType FailureResolutionType
 The type of failure resolution to be used to resolve the failure.
Exceptions
Exception | Condition
ArgumentException |  This FailureMessageAccessor has no resolution of resolutionType.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized. -or- This FailureMessageAccessor does not have any resolutions.
Remarks
 When FailuresAccessor is used to resolve failures, it will execute resolutions based on current resolution type. If no current resolution type is set, the default resolution type will be used. Setting is performed on the FailureMessageAccessor object itself, so if there are several accessors issued for the same FailureMessage, setting of the resolution type performed on one of them does not impact the others.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace